EPA_ALPHABET = {
    # vocals
    'i': 'i',
    'e': 'e',
    'a': 'a',
    'o': 'o',
    'u': 'u',
    'í': 'I',
    'é': 'E',
    'á': 'A',
    'ó': 'O',
    'ú': 'U',
    'ů': 'U',
    'y': 'I',
    'y': 'i',

    # diphtongs
    'ou': 'y',
    'au': 'Y',
    'eu': 'F',

    # fricatives
    'f': 'f',
    'v': 'v',
    's': 's',
    'z': 'z',
    'š': 'S',
    'ž': 'Z',
    'ch': 'x',
    'h': 'h',
    'l': 'l',
    'r': 'r',
    'ř': 'R',
    'j': 'j',
    'p': 'p',
    'b': 'b',
    't': 't',
    'd': 'd',
    'ť': 'T',
    'ď': 'D',
    'k': 'k',
    'g': 'g',

    # nasals
    'm': 'm',
    'n': 'n',
    'ň': 'J',

    # affricates
    'c': 'c',
    'č': 'C',
    'dz': 'w',
    'dž': 'W',

    'ě': 'je',

    # interpunction
    '. ': '|$|',
    '.': '|$|',
    '; ': '|$|',
    ';': '|$|',

    ',': '|#|',
    ', ': '|#|',
}